INSERT INTO times(name, theory)
VALUES ('Present Simple', '💡 Present Simple (простое настоящее)

1⃣ К Present Simple мы обращаемся в тех ситуациях, когда хотим сообщить какую-то общую информацию о человеке (рассказать о его принадлежности к какому-то классу, профессии и т. п.). Например, «I am a student» (я студент).

2⃣ Также настоящее простое время необходимо для того, чтобы сообщить о действии, которое повторяется систематически. Например, «He cooks» (он готовит). В данном примере имеется в виду, что он в принципе умеет готовить еду, делает это постоянно, а не в какой-то конкретный отрезок времени.

3⃣ Также Present Simple в используются для:
· Описания природных явлений и фактов (The Earth goes around the Sun —Земля вращается вокруг Солнца);
· Спортивных комментариев (Messi scores a goal — Месси забивает гол);
· Расписаний транспорта, трансляций, киносеансов и т. п. (The train from Moscow arrives at 6:05 p.m. — Поезд из Москвы прибывает в 18:05);
· Внутреннего состояния, чувств (Do you want to go away? — Ты хочешь уйти?).

4⃣ Распознать Present Simple в речи можно и по словам-маркерам , которые определяют частотность действия:
· always (всегда);
· usually (обычно);
· never (никогда);
· sometimes (иногда);
· rarely (нечасто);
· seldom (редко);
· regularly (регулярно);
· every day (каждый день);
· often (часто).'),


       ('Past Simple', '💡 Past Simple (прошедшее простое время)

1⃣ Расскажет о том, что произошло когда-то в прошлом, без привязки к настоящему. Действие завершено, и это главное.
• Kate celebrated her birthday yesterday. — Кейт вчера отметила день рождения.
• Tom graduated from school three years ago. — Том окончил школу три года назад.

2⃣ Чтобы правильно образовать форму прошедшего времени, нужно знать, правильный перед нами глагол (regular verb) или неправильный (irregular). В утвердительных предложениях в Past Simple к правильным глаголам добавляется окончание -ed, а формы неправильных глаголов придется запоминать.

3⃣ В отрицании и вопросе появляется вспомогательный did. Глагол to be в Past Simple имеет две формы:
• I, he, she, it was;
• you, we, they were;'),


       ('Future Simple', '💡 **Future Simple** (будущее простое время) нужно для того, чтобы говорить о своих спонтанных решениях, давать обещания и прогнозы. Образуется с помощью вспомогательного will.

• I will have pizza and Coke. — Я буду пиццу и колу.
• I promise we will stay in touch. — Обещаю, что мы останемся на связи.
• He will win the competition, I bet. — Держу пари, он победит в соревновании.'),


       ('Present Continuous', '💡 Если действие происходит в момент речи, то мы используем Present Continuous , или настоящее длительное время. Эта временная конструкция строится с помощью вспомогательного глагола to be, который, в зависимости от лица и числа, принимает одну из трех форм. Для местоимения I (я) мы используем форму am. В третьем лице единственного числа (местоимения he, she, it) to be принимает форму is, а во множественном числе — are.

Давайте рассмотрим, как употребляется Present Continuous на конкретных примерах:

I am looking at you — Я смотрю на тебя (сейчас, то есть в момент речи).

His English is getting better — Его английский становится лучше (действие находится в процессе).
Узнать больше

She is working from 9 till 7 — Она работает с 9-ти до 7-и (действие, которое охватывает отрезок времени в настоящем).

I am meeting him at 7 at the cinema — Я встречаюсь с ним в 7 часов в кино (действие, которое запланировано, и при этом нам известны время и место).

They are going to the opera — Они идут в оперу (действие в ближайшем будущем, Present Continuous в таком случае используется исключительно с глаголами движения).

He is always annoying me — Он всегда меня раздражает (выражение негативной оценки по поводу привычки, регулярного поведения).

Помочь распознать в речи настоящее длительное время могут такие слова-маркеры, как now (сейчас) и at the moment (в настоящий момент). Если речь идет о какой-то привычке и наклонности (часто в отрицательном контексте), то в данном случае Present Continuous сопровождается следующими наречиями:

· all the time (все время);
· always (всегда);
· constantly (постоянно).'),


       ('Past Continuous', 'Времена группы past, как правило, обращаются ко второй форме глагола. Не является в этом плане исключением и Past Continuous . Это время формируется путем прибавления 2-й формы вспомогательного глагола to be, а именно was для единственного числа и were для множественного. К смысловому глаголу в обязательном порядке добавляется окончание -ing.

К Past Continuous следует обращаться в следующих ситуациях:

· Продолжительное действие, которое в прошлом происходило в определенный период (He was playing football at 11 o''clock — Он играл в футбол в 11 часов);

· Действие, которое протекало в прошлом, в то время как произошло другое действие (He was reading when somebody knocked at his window — Он читал, когда кто-то постучал в окно).

Также Past Continuous часто можно встретить в описательных художественных текстах, где автор ставит задачу создать нужную атмосферу:

It was getting dark, and the wind was howling — Становилось темно, и завывал ветер.

В фразах с Past Continuous мы часто наблюдаем обстоятельства, указывающие на период времени:

· all day long (весь день);
· all the time (все время);
· the whole day (целый день);
· from 7 till 11 (с 7 до 11).'),

       ('Future Continuous', 'Далеко не все времена на английском имеют русские аналоги. Например, Future Continuous с точки зрения русскоговорящего вряд ли будет чем-то отличаться от простого будущего. Однако жители англоязычных стран обращаются к этому времени в следующих ситуациях:

· Продолжительное действие, которое будет происходить в определенный момент в будущем (This time next Monday she will be flying to Paris — В ближайший понедельник в это время она будет лететь в Париж);

· Продолжительное действие, на фоне которого произойдет в будущем другое более короткое. При этом мы не знаем, прервется ли первое действие или будет продолжено. (We will be sleeping when he arrives to New York — Мы будем спать, когда он приедет в Нью-Йорк);

· Для обозначения двух и более действий, которые будут происходить в будущем одновременно (While they are playing chess I will be cooking dinner — Пока они будут играть в шахматы, я буду готовить обед).

Future Continuous образуется с помощью вспомогательной формы will be и смыслового глагола с окончанием -ing.

Будущее продолженное время также можно распознать по словам-маркерам. Это могут быть обстоятельства времени:

· at 5 o''clock (в пять часов);
· at that moment (в этот момент);
· in an hour (через час);
· this time tomorrow (в это же время завтра) и т. п.

Если речь идет о придаточных предложениях с Future Continuous, то здесь мы часто видим такие союзы, как: if (если), as (в то время как), while (пока), when (когда), until (пока не), before (до).'),


       ('Present Perfect', 'Примеры Present Perfect в школьных учебниках далеко не всегда позволяют составить полную картину того, как же в действительности использовать это время. На самом деле оно очень широко распространено. Present Perfect обычно применяют в таких ситуациях:

Для обозначения действия, которое уже абсолютно завершено в прошлом, но, тем не менее, оно еще связано с настоящим посредством результата (I have read this book so you can take it — Я уже прочитал эту книгу, так что ты ее можешь взять);
Для характеристики действия, которое началось в прошлом, но, при этом, оно продолжается и в настоящий момент (I have lived in London for 6 years — Мы живем в Лондоне 6 лет).
В предложениях с настоящим совершенным временем часто встречаются наречия и обстоятельства, подчеркивающие результативность действия:

· never (никогда);
· just (только что);
· already (уже);
· yet (еще);
· ever (когда-либо);

Например: Have you ever been to Cyprus? — Ты когда-либо был на Кипре?'),


       ('Past Perfect', 'Если действие завершилось до какого-то определенного момента или действия в прошлом, то, согласно правилам английской грамматики, придется выбрать время Past Perfect. Например, «The rain had stopped before he woke up — Дождь завершился до того, как он проснулся». Или: «By that time they had finished their work — К тому времени они закончили свою работу».

Опознать Past Perfect часто можно по союзу by и обстоятельствам времени, вроде: by that time (к тому времени), by Monday (к понедельнику), by then (к тому времени) и т. п.'),

       ('Future Perfect', 'Future Perfect используется в тех ситуациях, когда нам нужно сообщить о действии, которое завершится до определенного момента в будущем: «I will have written the article by night — Я напишу статью к ночи». Будущее совершенное время мы также употребляем, когда говорим о каком-то предполагаем действии, которое имело место в прошлом. Иными словами, Future Perfect нужно для того, чтобы выразить предположение о том, что вероятно произошло. Например, «You will have noticed our attitude to this problem — Ты (наверняка) заметил наше отношение к этой проблеме».

Фразами-маркерами для Future Perfect также служат обстоятельства времени, которые указывают момент для завершения действия:

· by Sunday (к воскресенью);
· by that time (к тому времени);
· by 2033 (к 2033).'),


       ('Present Perfect Continuous', 'Present Perfect Continuous показывает действие, начавшееся в прошлом и продолжающееся на момента речи. Например: «She has been working for 5 hours already — Она уже работает 5 часов». Также это время используется для характеристики только что завершившегося длительного действия, результат которого влияет на настоящее: «I''m tired. We have been working all night — Я устал. Мы работали всю ночь».

Во фразах с настоящим совершенным продолженным временем в английском часто встречаются обстоятельства времени и прочие словосочетания, которые обозначают тот временной отрезок, в течение которого совершается действие. Например:

· for a week (в течение недели);
· since morning (с утра);
· lately (в последнее время);
· all my life (всю мою жизнь) и т. п.'),

       ('Past Perfect Continuous', 'Время Past Perfect Continuous похоже на предыдущее, однако описывает растянутое действие, которое началось в прошлом до определенного момента (который произошел также в прошлом и всегда употребляется в Past Simple). Этот процесс может продолжаться или же завершиться непосредственно прямо перед этим самым моментом.

«Tom had been reading for 2 hours when Jane came — Том читал уже на протяжении двух часов, когда пришла Джейн». В данном случае действие началось до того, как пришла Джейн. При этом, Том продолжает читать даже после того, как его прервали.

Для прошедшего совершенного продолженного времени характерно использование временных фраз-маркеров, вроде:

· for five months (в течение 5 месяцев);
· for a long time (в течение долгого времени);
· since 7 o''clock (с 7-ми часов) и т. п.'),

       ('Future Perfect Continuous', 'Среди всех времен английской грамматики Future Perfect Continuous встречается в речи реже всего. Это время описывает продолжительное действие, которое начнется в будущем и будет происходить до определенного момента (он употребляется в Future Simple):

He will have been resting for a week when she joins him — Он будет отдыхать уже целую неделю, когда она присоединится к нему.')

